#include <ultra64.h>
#include <global.h>

#pragma GLOBAL_ASM("asm/non_matchings/code/z_vr_box/func_800ADBB0.s")

#pragma GLOBAL_ASM("asm/non_matchings/code/z_vr_box/func_800AE2C0.s")

#if 0
typedef struct {
    /* 0x00 */ s32  unk_00;
    /* 0x04 */ s32  unk_04;
    /* 0x08 */ s32  unk_08;
    /* 0x0C */ s32  unk_0C;
    /* 0x10 */ s32  unk_10;
} Unk_8012AEBC; // size = 0x14

extern Unk_8012AEBC D_8012AEBC[];

void func_800AEFC8(SkyboxContext* vr_box, s16 skyboxId) {
    Unk_8012AEBC *phi_s0;
    u32 phi_s2 = 0;
    s32 phi_s3 = 0;
    s32 i;

    if (skyboxId == 2 || (skyboxId >= 0x11 && skyboxId < 0x19)) {
        for (i=0; i < 2; i++) {
            phi_s0 = &D_8012AEBC[i];
            phi_s3 = func_800ADBB0(vr_box, vr_box->roomVtx, phi_s3, phi_s0->unk_00, phi_s0->unk_04, phi_s0->unk_08, phi_s0->unk_0C, phi_s0->unk_10, i, phi_s2);
            phi_s2 = phi_s2 + 2;
        }
        return;
    }

    if (vr_box->unk_140 == 2) {
        for (i=0; i < 3; i++) {
            phi_s0 = &D_8012AEBC[i];
            phi_s3 = func_800ADBB0(vr_box, vr_box->roomVtx, phi_s3, phi_s0->unk_00, phi_s0->unk_04, phi_s0->unk_08, phi_s0->unk_0C, phi_s0->unk_10, i, phi_s2);
            phi_s2 = phi_s2 + 2;
        }
        return;
    }

    for (i=0; i < 4; i++) {
        phi_s0 = &D_8012AEBC[i];
        phi_s3 = func_800ADBB0(vr_box, vr_box->roomVtx, phi_s3, phi_s0->unk_00, phi_s0->unk_04, phi_s0->unk_08, phi_s0->unk_0C, phi_s0->unk_10, i, phi_s2);
        phi_s2 = phi_s2 + 2;
    }
}

/*
void func_800AEFC8(SkyboxContext* vr_box, s16 skyboxId) {
    s32 temp_a1;
    s32 temp_s1;
    s32 temp_s1_2;
    s32 temp_s1_3;
    s32 phi_s3;
    Unk_8012AEBC *phi_s0;
    s32 phi_s1;
    s32 phi_s2;
    s32 phi_s3_2;
    Unk_8012AEBC *phi_s0_2;
    s32 phi_s1_2;
    s32 phi_s2_2;
    s32 phi_s3_3;
    Unk_8012AEBC *phi_s0_3;
    s32 phi_s1_3;
    s32 phi_s2_3;

    if (skyboxId == 2) {
block_3:
        phi_s3_3 = 0;
        phi_s0_3 = &D_8012AEBC;
        phi_s1_3 = 0;
        phi_s2_3 = 0;
loop_4:
        temp_s1 = phi_s1_3 + 1;
        phi_s3_3 = func_800ADBB0(vr_box, vr_box->roomVtx, phi_s3_3, phi_s0_3->unk_00, phi_s0_3->unk_04, phi_s0_3->unk_08, phi_s0_3->unk_0C, phi_s0_3->unk_10, phi_s1_3, phi_s2_3);
        phi_s0_3 = phi_s0_3 + 0x14;
        phi_s1_3 = temp_s1;
        phi_s2_3 = phi_s2_3 + 2;
        if (temp_s1 != 2) {
            goto loop_4;
        }
        return;
    }
    if (skyboxId >= 0x11) {
        if (skyboxId < 0x19) {
            goto block_3;
        }
    }
    if (2 == vr_box->unk_140) {
        phi_s3 = 0;
        phi_s0 = &D_8012AEBC;
        phi_s1 = 0;
        phi_s2 = 0;
loop_8:
        temp_s1_2 = phi_s1 + 1;
        phi_s3 = func_800ADBB0(vr_box, vr_box->roomVtx, phi_s3, phi_s0->unk_00, phi_s0->unk_04, phi_s0->unk_08, phi_s0->unk_0C, phi_s0->unk_10, phi_s1, phi_s2);
        phi_s0 = phi_s0 + 0x14;
        phi_s1 = temp_s1_2;
        phi_s2 = phi_s2 + 2;
        if (temp_s1_2 != 3) {
            goto loop_8;
        }
        return;
    }
    phi_s3_2 = 0;
    phi_s0_2 = &D_8012AEBC;
    phi_s1_2 = 0;
    phi_s2_2 = 0;
loop_11:
    temp_s1_3 = phi_s1_2 + 1;
    phi_s3_2 = func_800ADBB0(vr_box, vr_box->roomVtx, phi_s3_2, phi_s0_2->unk_00, phi_s0_2->unk_04, phi_s0_2->unk_08, phi_s0_2->unk_0C, phi_s0_2->unk_10, phi_s1_2, phi_s2_2);
    phi_s0_2 = phi_s0_2 + 0x14;
    phi_s1_2 = temp_s1_3;
    phi_s2_2 = phi_s2_2 + 2;
    if (temp_s1_3 != 4) {
        goto loop_11;
    }
}
*/

#else
#pragma GLOBAL_ASM("asm/non_matchings/code/z_vr_box/func_800AEFC8.s")
#endif

typedef struct {
    /* 0x00 */ u32  unk_00;
    /* 0x04 */ u32  unk_04;
    /* 0x08 */ u32  unk_08;
    /* 0x0C */ u32  unk_0C;
    /* 0x10 */ u32  unk_10;
} Unk_8012AF0C; // size = 0x14
extern Unk_8012AF0C D_8012AF0C[];

void func_800AF178(SkyboxContext* vr_box, s32 count) {
    s32 phi_s2 = 0;
    Unk_8012AF0C *phi_s0;
    s32 i;

    for (i=0; i < count; i++) {
        phi_s0 = &D_8012AF0C[i];
        phi_s2 = func_800AE2C0(vr_box, vr_box->roomVtx, phi_s2, phi_s0->unk_00, phi_s0->unk_04, phi_s0->unk_08, phi_s0->unk_0C, phi_s0->unk_10, i);
    }
}

#if 0

typedef struct {
    /* 0x00 */ u16  unk_00;
    /* 0x02 */ u16  unk_02;
    /* 0x04 */ u8   unk_04;
    /* 0x05 */ u8   unk_05;
    /* 0x06 */ u8   unk_06;
    /* 0x0C */ u32  unk_0C;
    /* 0x10 */ u32  unk_10;
} Unk_temp_a3; // size = 0x14

extern void * D_8011FC1C;
extern void * D_8011FD3C;
void func_800AF218(GlobalContext* globalCtx, SkyboxContext* vr_box, s32 arg2) {
    s32 sp44;
    u8 sp41;
    u8 sp40;
    void *sp30;
    void *sp2C;
    s32 temp_a1;
    s32 temp_a1_2;
    s32 temp_ret;
    s32 temp_ret_10;
    s32 temp_ret_11;
    s32 temp_ret_12;
    s32 temp_ret_13;
    s32 temp_ret_14;
    s32 temp_ret_15;
    s32 temp_ret_16;
    s32 temp_ret_17;
    s32 temp_ret_18;
    s32 temp_ret_19;
    s32 temp_ret_20;
    s32 temp_ret_21;
    s32 temp_ret_22;
    s32 temp_ret_23;
    s32 temp_ret_24;
    s32 temp_ret_25;
    s32 temp_ret_26;
    s32 temp_ret_27;
    s32 temp_ret_28;
    s32 temp_ret_29;
    s32 temp_ret_2;
    s32 temp_ret_30;
    s32 temp_ret_31;
    s32 temp_ret_32;
    s32 temp_ret_33;
    s32 temp_ret_34;
    s32 temp_ret_35;
    s32 temp_ret_36;
    s32 temp_ret_37;
    s32 temp_ret_38;
    s32 temp_ret_39;
    s32 temp_ret_3;
